name: "postprocessing" 
backend: "python" 

input [
    {
        name: "SCORES"
        data_type: TYPE_FP32 
        dims: [-1, -1]
    }
]

output [
    {
        name: "RESULT" 
        data_type: TYPE_STRING 
        dims: [-1]
    }
]

instance_group [
    {
        kind: KIND_CPU
    }
]