name: "preprocessing" 
backend: "python" 

input [
    {
        name: "RAW_IMAGE"
        data_type: TYPE_STRING 
        dims: [-1]
    }
]

output [
    {
        name: "INPUT_IMAGE" 
        data_type: TYPE_FP32 
        dims: [-1, 3, -1, -1]
    }
]

instance_group [
    {
        kind: KIND_CPU
    }
]